{"keras_version": "2.2.4", "config": {"layers": [{"config": {"batch_input_shape": [null, 160, 320, 3], "trainable": true, "dtype": "float32", "output_shape": [160, 320, 3], "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+SwAAAHMAAAAA\n", null, null]}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "strides": [4, 4], "bias_regularizer": null, "filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "padding": "same", "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_1", "kernel_size": [8, 8], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "padding": "same", "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_2", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "strides": [2, 2], "bias_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "padding": "same", "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv2d_3", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"rate": 0.2, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "activation": "linear", "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0, "l1": 0.0}, "class_name": "L1L2"}, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}